{
  "Books": [
    {
      "author": "Dazai, Osamu",
      "dateFinish": "May 05, 2023",
      "dateStart": "May 03, 2023",
      "rating": "liked it",
      "review": "JUST BOYS BEING BOYS; especially after one of the homies attempted a lover's suicide and survived.I didn't even know one of my favorite novels had a prequel. So when I randomly picked this book up in a cute bookshop in DC, I was so excited. Although, Dazai wrote No Longer Human years later, the characteristics of Yozo fit so well and it didn't feel abnormal to read about Yozo again. The story itself is not particularly exciting; I mean the story revolves around Yozo being in the hospital for less than a week, so not much happens. But the vibe of the book was just really warming, even though Yozo just went through such a tragic event. Basically, Yozo's friends come to console him while he's in the hospital, and they have a great time together while also tiptoeing around the dark atmosphere of Yozo's depression and suicide attempt. It's just nice to read about someone having such great companions in their life. Dazai just randomly interjects his thoughts, opinions, and rants throughout the novel. A character could be in the middle of dialogue and then he'll randomly input his hatred for the character that he is literally writing about. My favorite line from the book is: \"White smoke from the volcano on Oshima, just above the horizon, drifted up into the sky. Nevermind. I hate describing scenery\" That's literally the hardest line from all his novels. Bro was ahead of his time. I know that's pretentious to say now, but what other author in the 1930s is breaking the fourth wall like that? Anyways, the content of the book was lackluster but the vibes were up, making it very enjoyable - plus it was a quick read. Overall Score: 3.9/5",
      "title": "The Flowers of Buffoonery"
    },
    {
      "author": "Camus, Albert",
      "dateFinish": "Apr 24, 2023",
      "dateStart": "Apr 14, 2023",
      "rating": "liked it",
      "review": "Bro is the most delusional, narcissistic, self-centered, pathological coward I have ever read about. But that's what makes the book interesting. I don't know how to label the narration of this book. It's like a third person since the actual narrator never says a single word. The main character Jean-Baptiste Clamence kind of steals the whole narration, and describes the facial expressions or even skips over the whole dialogue with the narrator. So is it really third person, or is it second person and Jean is just narrating his story to a random person??? idk, but it is really hard for me to wrap my head around it for some reason. Anyways, the story starts when Jean starts talking to the narrator in an Amsterdam bar. He's really respectful and social; which just comes off as odd. He hypes himself up and starts describing his life as a lawyer and how he was so good to those in need. As I described in my first sentence, he is all of those traits. So you can't really take his word for it, but you just go along with it at first. He admits at the end of the first encounter, that it is not out of the goodness of his heart that he treats everyone with respect; he does it to keep up an outstanding reputation. The story follows him over 5 days. After every encounter with him, you peel back a layer of his personality and realize that he is the scum of the earth (by social standards of course). It's quite literally a verbal \"Fall from grace\". Although you can't believe 100% of what he says, I do find it respectable that he is honest about his flaws. I do think this was a pretty average read in terms of how engaged I felt throughout reading it, but the concept and the perspective of narration intrigue me. Overall Score: 3.5/5",
      "title": "The Fall"
    },
    {
      "author": "Kawaguchi, Toshikazu",
      "dateFinish": "Mar 14, 2023",
      "dateStart": "Feb 19, 2023",
      "rating": "did not like it",
      "review": "I love the concept of time travel and my literal dream is to open a coffee shop once I retire, so you would think I would love this book. Unfortunately, I found it dull and very, VERY, slow. The story is comprised of 4 different situations of certain people traveling back in time in the cafe. The majority of these characters are reoccurring in all 4 scenarios. The basic idea of this version of time travel is that a person can travel back in time while sitting in the seat of a specific cafe. Once you are in the past, you cannot move from your seat and you must finish your coffee before it gets cold. The actions you make while in the past, do not affect the present at all. MY BIGGEST PROBLEM WITH THIS BOOK IS THAT NOTHING HAPPENS. Because no actions you make in the past affect the present, the story seems to have no driving plot. It kind of takes away the mysteries of time travel. The butterfly effect is completely taken off the table, the idea of multiple timelines is basically destroyed, and one can argue that there is no reason to visit the past since nothing actually changes. The characters that time traveled really only get closure or at least something to think about from their visits to the past. But like 3 out of the 4 characters could have just gotten a therapist. Like why even travel into the past anyways???I only really enjoyed the second story since it felt more unique and heartwarming. It's about a husband with dementia and a wife that has seen it coming for a long time but has to come to terms with it. I feel like you could read just the second story and feel fulfilled by the book. The other stories just seem so typical. I think I'm just really mad it took me so long to read this book because I was so bored. Maybe the sequels to this book are better, but I don't think I'll be giving them a chance anytime soon. Overall Score: 1.5/5",
      "title": "Before the Coffee Gets Cold (Before the Coffee Gets Cold, #1)"
    },
    {
      "author": "Mishima, Yukio",
      "dateFinish": "Feb 07, 2023",
      "dateStart": "Feb 05, 2023",
      "rating": "really liked it",
      "review": "Brilliantly absurd. The most bizarre introduction to a book I have ever read and it just kept getting crazier!I had so much fun reading this book because it was just insane. Like you quite literally have to be on something to write a story like this, but I think that's part of the reason I loved this book. Every arc felt so random. If you tried to guess what would happen next, you'd probably be wrong 99% of the time. Hanio is a dude that just attempted suicide on a whim and failed. Since he just failed death, he no longer has many emotions towards societal standards, good vs. evil, or even his own well-being. He becomes the embodiment of \"go with the flow\". So he quits his job, puts an ad in the newspaper saying \"Life For Sale\", and just waits at his apartment. From then on he gets involved with shady customers that get him into situations that are less than favorable. Even though these situations are dark and shocking to most, he still just goes through with it. It's just so insane to me that it becomes funny. Every page you turn you say \"how could this possibly get worse\" and then it absolutely gets worse. You're basically just sitting like :0 the whole time you read this book. That's why I loved it. The unpredictable situations this average dude gets into are like opening Pandora's box, but the way Yukio Mishima writes the story is just so seamless and entertaining. Very confused about how this book is not like the top 50 of Japanese modern literature.THE ENDING IS SUCH A CLIFFHANGER. I WISH THIS STORY HAD A SEQUEL >:I Overall Score: 4.9/5",
      "title": "Life for Sale"
    },
    {
      "author": "Castro, Jordan *",
      "dateFinish": "Apr 02, 2023",
      "dateStart": "Mar 16, 2023",
      "rating": "liked it",
      "review": "I think this is the most impartial I've felt toward a book. The story is about an author that is procrastinating on writing his novel. The whole story takes place in just one morning; mainly in his own home. He goes on his laptop to start typing, gets distracted by Twitter, then Insta, then back to his Word document for a moment, ultimately returning back to the Twitter tab for the third time in less than a span of 10 seconds. Those parts of the story gave me genuine anxiety, which is why I feel like the book can be somewhat relatable. As the story goes on, it doesn't get better for the author. Really the whole book is a sequence of actions that allow him to keep procrastinating for the full morning.I didn't really find the story entertaining, but I was definitely impressed by the talent of an author to be able to write 196 pages about literally nothing.Would I recommend the book? Probably not. But I do have high respect for Jordan Castro and English/Journalism majors that are able to write like this.Overall Score: 3/5",
      "title": "The Novelist"
    },
    {
      "author": "Coelho, Paulo *",
      "dateFinish": "Feb 11, 2023",
      "dateStart": "Feb 08, 2023",
      "rating": "really liked it",
      "review": "This was such a fulfilling book. The character development of Santiago just overjoyed my heart. I've never seen an author write such a self-compassionate character before, and it made me reflect on myself. Our main character is a young shepherd named Santiago. Santiago's been having reoccurring dreams of finding treasure near the pyramids in Egypt. The story is about his journey to find this treasure that may or may not exist and along the way, he meets many people that change his perspective, teach him new things, and help him during challenging situations. I saw alot of people clownin on this story in the reviews >:(I genuinely think these haters read the book literally and were too ignorant to enjoy the casual self-reflection you achieve while reading this story. Obviously, the story is the typical \"It's about the journey, not the destination\" type of book. But if that's all you got out of it, then I can just tell you the type of person to sneeze into the open air/ keep walking while your friend is tying their shoes/ chew with your mouth open/ say the most out of pocket things at improper times. Basically, I just wouldn't want to be your friend.I think reading this book helps if you believe in God, higher powers, or the mystical abilities of the universe. You kinda feel one with it all; especially at the end when Santiago does some air bending. I typically don't read philosophical stories, but my boy Paulo really piqued my interest in them \\(◦'⌣'◦)/Maktub.Overall Score: 4.6/5",
      "title": "The Alchemist"
    },
    {
      "author": "Haig, Matt *",
      "dateFinish": "Feb 04, 2023",
      "dateStart": "Jan 27, 2023",
      "rating": "it was ok",
      "review": "I didn't hate the novel, but at the same time, I didn't love it.I love chocolate chip cookies; especially when they're warm and gooey. This felt more like a room-temperature sugar cookie - not quite a chocolate chip cookie, but good enough. Nora, our main character, just attempted suicide but gets stuck in a purgatorial state called the Midnight Library. She lives multiple variations of her life and learns throughout each of them. This phenomenon is explained to be a feat of quantum mechanics; having the essence of a Schrodinger's cat situation. I kind of like this interpretation of parallel universes after death, but also kind of hate it because I think it's way too oversimplified. My main issue with this book is that it felt too predictable. After the explanation of the Midnight Library in the novel, I had a pretty accurate conception of how the book would end. I'm really not a fan of predictable stories but this one had some good random things sprinkled in. I felt like Nora didn't struggle to overcome her depression in this novel; almost like she was guided so easily by Mrs. Elms in the library. I heard Matt Haig is known for his writing specializing in depression and mental health, so this depiction of overcoming depression was not what I quite expected. I'll probably give another one of his novels a read later on to see what he's really known for. The cover art is pretty sick tho :DOverall Score: 2.3/5",
      "title": "The Midnight Library"
    },
    {
      "author": "Murakami, Haruki",
      "dateFinish": "Jan 26, 2023",
      "dateStart": "Jan 18, 2023",
      "rating": "really liked it",
      "review": "I wanted to read some work by Murakami because I heard it's challenging to get through at times. So I picked up the novel that pushed him to stardom in Japan. The critique of Murakami was definitely correct. 5 pages of Reiko's backstory was enough to make me feel uncomfortable for two days. Other than that section of the novel, I thoroughly enjoyed the rest. Every character serves a purpose in Toru's life. Mostly because he doesn't go out of his way to make friends, but when he does, they serve an important role. All of these characters were likable in their own way and each have their own flaws of course. Even an asshole like Nagasawa can have shining traits to him at times. What was interesting to me was that the pace of the plot never seemed to revolve around Toru, the main character. Naoko's well-being seemed to hold a precedent over his life and would direct nearly all his actions. I found this to be sweet, but at the same time so discouraging since we know it would never work out between them from the first chapter. I really like Toru as a character. I saw a bunch of reviews detailing how pitiful he was, which I find so compassionless. He had gone through so much starting at 17 years old, and the pain never really left him. Haunted by loss and love, he truly did the best that he could do at all times. He never really moped around or felt entitled to anything. He worked hard for his money, his education, and himself; albeit, even if it was just to keep himself busy. Of course, he had his ups and downs, but what kind of human wouldn't? There's a lot of suicide in this story. The death of some of these characters left me feeling so demoralized. The first sentence of chapter 11 tore my heart out of my chest and had me yelling into my pillow that life was so unfair. However, the ending was somewhat wholesome even if the book did leave me feeling numb til I fell asleep. I truly wish the best for everyone, but novels such as this remind me that some people just do not get that opportunity in life. Loved the rollercoaster of emotions this story took me through. Will be reading another work by Murakami soon :)Overall Score. 4.5/5",
      "title": "Norwegian Wood"
    },
    {
      "author": "Murakami, Haruki",
      "dateFinish": "Feb 16, 2023",
      "dateStart": "Feb 11, 2023",
      "rating": "liked it",
      "review": "My oh my, does Murakami have such a way with words - but specifically to make you uncomfortable. The only other Murakami novel I've read is Norwegian Wood, and it's safe to say this book is in a totally different realm. Oddly enough I feel like Kafka on the Shore was a darker, twisted, fantasy version of Norwegian Wood. Both novels are entwined in realism, but this book is a little more magical. The story revolves around a 15-year-old boy who names himself Kafka. He leaves home because his dad isn't the best and curses him with an Oedipus-like prophecy. At the same time, the story also revolves around a 60-year-old man called Nakata who lost the ability to read, write and comprehend things after a bizarre accident when he was young during the war. Their stories alternate throughout the book and, at first, seem to have no relevance to each other. Eventually, their paths cross - but not really - causing both of them to be on the run from the police and fix their lives. Sound normal? Well, it really isn't at all. The novel is written with magical realism; so, while most of the story seems like the ordinary everyday lives of these two individuals, there are also random elements of fantasy written sprinkled around the book. When we meet Nakata, he's able to talk to cats. He doesn't know why he's able to talk to cats, just that after the mysterious accident he gained that ability. Eventually, he gains other mystical abilities on a quest to flip over a stone that will close the portal to another realm. Kafka, while on the run from the police, gains the ability to see a ghost. That he falls in love with. That also happens to be the ghost of a living 50-year-old librarian name Miss Saeki whom he kind of works for. That also may or may not be his mother...Honestly, the novel ends up feeling like a fever dream as you continually read it. There were points in the book where it just felt like the most random things were happening and you just gotta keep reading to see what happens. At one point I think Murakami himself shows up in the middle of the novel in the form of Colonel Sanders - literally the KFC mascot. He's like a pimp in the book, but also just a concept; whatever that means. My favorite characters were Nakata, Oshima, and Hoshino. They were kinda just vibing throughout the novel and were just cool people in general. The interesting thing I experienced was getting bored of Kafka's perspective and then being able to read Nakata's update in the next chapter and vice-versa. It was really refreshing and made getting through the story easier. Somehow their lives intertwine and even now I'm still trying to piece together how and why. There are a lot of mysterious riddles left unsolved after finishing the book so be prepared for that feeling of confusion. The mystical realm kind of feels like an unfinished concept, but that adds to the mystery which is what I guess Murakami wanted. I definitely enjoyed Norwegian Wood way more, but this was still a fun read. @ex-wifey. If you see this I kinda wanna know what you thought of the book cuz I still don't really understand what happened. P.S. the kids miss you. come home <3Overall Score: 3.5/5",
      "title": "Kafka on the Shore"
    },
    {
      "author": "Ali, Kasim",
      "dateFinish": "Jan 13, 2023",
      "dateStart": "Jan 08, 2023",
      "rating": "really liked it",
      "review": "AHHHHH I LOVED THIS BOOK UNTIL THE LAST CHAPTERThis was an amazing love story that was brought to ruin because of the lack of courage and selfish acts of our main character Nur. I loved all the characters in the book. Nur is the eldest son of a Pakistani Muslim household, and although I am neither Pakistani nor Muslim, I lowkey understand the pressures he goes through as the eldest son of a South Asian family. He has anxiety due to his habit of overthinking and isn't the best with his words despite graduating with an English major and aspiring to become an author.Yasmina is the eldest daughter of a Sudanese Muslim household. Her family is pretty chill, but she also has her own issues regarding her younger sister. Yasmina's dialogue throughout the book made me fall in love with her personality (also because as I read the book, the image of what she looked like in my head was absolutely gorgeous). They met at Nur's ex's party and they hit it off from there. Their love story felt natural and made me smile as I read the book. They were quite literally meant for each other, but Nur basically had a thought in the back of his head that told him it was never meant to be due to the color of their skin. Although I liked Nur's character, I despised him as a person for some of his reckless words and cowardly actions. ESPECIALLY WITHIN THE LAST CHAPTER.The other side character progressed the story perfectly. One of my favorite aspects of the book was seeing these side-character relationships grow and diminish with Nur; specifically with Rahat and Imran.This story could have ended with a perfect romantic ending - but it didn't. Maybe that's exactly the type of ending this generation of Muslims, South Asians, etc. need. I just wish Nur did more.Can't wait for more work by Kasim Ali :DOverall Score: 4.5/5",
      "title": "Good Intentions"
    },
    {
      "author": "Wang, Weike",
      "dateFinish": "Jan 05, 2023",
      "dateStart": "Jan 04, 2023",
      "rating": "really liked it",
      "review": "Such an amazing read - this is the fastest I have read a book!As I flipped through the pages, it felt like a natural dialogue between me and a close friend going through depression. Almost as if this friend were catching me up on their life and how they are dealing with a breakup, stress, anxiety, and other variabilities of life. The main character is quite relatable. Someone who excelled in her academics in the past, mainly to impress her parents, realizing she isn't as brilliant as she once thought when having to apply what she learned to her PhD thesis. Obviously, obtaining a PhD is already an insanely difficult task to achieve; doing so while having a quarter-life crisis must be unbearable. Hearing her complain about her problems in academia felt notalgic to me and made me slightly miss the suffering of undergrad. I loved the snippets of science facts that were sprinkled throughout the book. Those random facts that still haunt me from my chemistry and physics classes have finally found a purpose. It made the story even more memorable to me. I really hope Weike Wang makes a sequel to this story. The main character of the book doesn't have a name. I wish she did because I would like to hear from her again. Overall Score: 4.8/5",
      "title": "Chemistry"
    },
    {
      "author": "Ramisetti, Kirthana *",
      "dateFinish": "Oct 27, 2022",
      "dateStart": "Oct 14, 2022",
      "rating": "really liked it",
      "review": "I can't even begin to describe how much I enjoyed this book. I typically read novels with nihilistic themes to make myself feel better about my life (selfish I know, but it's a guilty pleasure). Usually, the main characters in these stories have terrible flaws that they don't recognize or actively fix. Dava's life, in a sense, could be considered to be the opposite of nihilism. Obviously, we could label her life down to the theme of careerism; but, I feel as if that's simplifying it too much. Her obsession to control the narrative of her life is her way of making meaning out of her life and her legacy.I love Dava's character. Being Indian myself, I see my mother in Dava. A total badass, but also filled with annoying flaws that make me love her even more. It was so interesting for me to see similar cultural, social, emotional, mental, and financial aspects of life through just one character. Honestly, this is the first contemporary novel I've read featuring an Indian main character and a multicultural family with modern-day relationships. None of those themes overbore the sense of grief throughout the novel. The family, including Dava herself, had to come to terms with her planned death; all within a short period of time.Dava's secrets drive the story. Each one reveals the relationship between her and her children; not to mention how spicy each secret is. Such a strong-willed person is brought to their knees on some occasions. The ability to recognize her tragic past, and put it away to build a successful future is so heart-rending but is also so inspirational. By the end of the book, it had me questioning what I would want people to recognize me for. I am definitely biased since I feel like I can relate to the main character so well, but I would go as far as to say that this is one of the most enjoyable books I've read so far in my 23 years of life :)I will absolutely be reading more of Kirthana Ramisetti's work in the future!Overall Score: 4.7/5",
      "title": "Dava Shastri's Last Day"
    },
    {
      "author": "Weir, Andy *",
      "dateFinish": "not set",
      "dateStart": "not set",
      "rating": "liked it",
      "review": "Honestly, a pretty typical dystopian story where the main character has to save their society from the brink of collapse. Part of the reason I thought Artemis was a good read was because of how much I enjoyed the main character. She's a total badass and my imagination ran wild with the situations she was put through. I obviously don't hate the story, but at the same time, I don't think it particularly has any spectacular feature that sets it apart from any other young-adult dystopian society book. I will say though, that this story would have absolutely thrived in the Hunger Games, Divergent, Maze Runner era when I was in middle school.Overall Score: 3.7/5",
      "title": "Artemis"
    },
    {
      "author": "Hamilton, Peter F. *",
      "dateFinish": "not set",
      "dateStart": "not set",
      "rating": "liked it",
      "review": "Honestly, I felt kind of lost as I read Salvation Lost. I did not realize that this book was the second of a series called Salvation; a total misunderstanding on my part. Nonetheless, still a good read, and will definitely re-read it in the future once I read its predecessor. Overall Score: 3/5",
      "title": "Salvation Lost"
    },
    {
      "author": "Dazai, Osamu",
      "dateFinish": "not set",
      "dateStart": "not set",
      "rating": "really liked it",
      "review": "Again, another masterpiece by Dazai. Although No Longer Human definitely pulled on the string of my heart, it did not generate any tears as The Setting Sun did. I could not help but feel sympathetic towards Kazuko as she went through pitiful interactions with her mother, brother, and MC. Her relationship with her mother was truly inspirational, but at the same time felt so pathetic. Such selfless love for someone, only to be treated as second-class compared to her brother. I felt sorry for Kazuko because she was trapped. Having to spend so much love on someone while not being able to explore love for yourself must have been so taxing. This relationship makes you realize that love can be a double-edged sword. I thought her interactions with MC were the absolute worst; mainly because I believe MC to be the human embodiment of the scum under a frat boy's fingernails. I respect Naoji for at least acknowledging that he is disgraceful and unworthy of the love of his mother and sister. MC, on the other hand, is totally delusional about the fact that he is a walking black hole that sucks the life force of humans and transforms them into lifeless stars. It felt so disheartening to see Kazuko, a character that I highly respected, become infatuated with such a terrible person. At the same time, I understood her longing for being wanted and could not blame her for falling into his trashy appeal. In the end, we see such a great redemption arc from Kazuko. As the sun sets, a new day is to come. So is the same for the story of our new Kazuko. Her new life as a single mother will be difficult, but it excites me to know that the child won't be influenced by their piece of shit father :DOverall Score: 4.6/5",
      "title": "The Setting Sun"
    },
    {
      "author": "Dazai, Osamu",
      "dateFinish": "not set",
      "dateStart": "not set",
      "rating": "really liked it",
      "review": "Truly an amazing story with one of the worst main characters I have ever had the experience of reading about. This book gave me Catcher in the Rye vibes, in which I entirely adored the world-building that took place in my head as I conjured scenes from the story; however, I despised Holden Caulfield for his lack of self-respect and sense of responsibility for his actions. In the same way, I find Oba Yozo to be absolutely deplorable. I find the resolution to the story to be a total cop-out and unfair to those going through depression. I understand that Yozo has become so detached and desensitized to his surroundings due to experiences he has been through in the past - making him \"no longer human\" - but I still can't help but hate his actions and his cowardly demeanor. Don't get me wrong, this story pulled at the strings of my heart at times and had me screaming silently into my book simultaneously. Dazai is obviously a master of his craft, which makes it even heavier when I consider this story to be his last memoir before his suicide. This was the first piece of Dazai's work that I have read, and it will definitely not be the last!Overall Score: 4.3/5",
      "title": "No Longer Human"
    },
    {
      "author": "Yū, Miri",
      "dateFinish": "Jan 08, 2023",
      "dateStart": "Oct 03, 2022",
      "rating": "it was ok",
      "review": "This was genuinely such a difficult read for me. I'm the type of person who needs to finish a book before starting a new one. I had such little motivation to read this book; quite literally not touched the book for over 2 months.The premise of the story isn't that bad. I just think the story dragged on for so long that I began to hate how pitiful the main character is.This is my spoiler-free summary of the book: \"Unlucky man goes through a series of unfortunate events leading to the demise of his unsuccessful life - becoming a cursed spirit that is forced to watch even more unfavorable circumstances.\"If you want to direct your frustration toward a pathetic main character, then this is definitely the story to read. Overall Score: 2/5",
      "title": "Tokyo Ueno Station: A Novel"
    },
    {
      "author": "Ravn, Olga",
      "dateFinish": "not set",
      "dateStart": "not set",
      "rating": "liked it",
      "review": "What did I just read?Confusion is probably the best emotion I could describe from my experience reading this book. The composition of this book was really dope. It's structured as a semi-chronological logbook of a ship traveling through space. I say semi-chronological because it follows an interesting pattern where groups of 10s may be out of order, but the factors of 10s are in order. (You'll understand as you read through the book)Here's the basic rundown. Employees on a ship traveling through space. Some are human, some are humanoids (robots with AI sentience and biological features of a human). Objects are placed in a special room of the ship and get switched out routinely. The objects have powers (maybe?). Humans and Humanoids report to a third party. Something goes wrong and a third party steps in. A weird ending happens that I don't know if I'm happy with. Don't ask me what the objective of the ship and its employees were, the purpose of the objects, who the third party is, etc., because I have no idea. I wish I could tell you, but that synopsis I gave you above is the best I could do. I found it funny that I related to the humanoids more and enjoyed their logs more than the humans. Their stories are just more interesting. They are told that they are updated versions of humans, but they also know that they are sentient robots. The majority of the humanoids all kind of felt the presence of emotions, or at least the thought of having emotions. The humans, all kind of seemed boring to me. They all left Earth for their own reasons, and most of the human logs described how much they missed Earth. The relationships between humans and humanoids never seemed to be overtly hostile; which I enjoyed. In fact, some of the humans and humanoids were friends that would regularly eat together in the canteen. I was relieved it did not turn into a humans-versus-humanoids war story. I want to throw out a wild guess based on the title \"The Employees\" and say the story depicts our current societal views on big corporations and workplaces. Maybe the ships true objective is meant to be unknown because no employee really knows what the truth behind corporations goals are or what they're doing behind closed doors. Maybe the distinction between humans and humanoids is a reference to the new and older generation of workers? or perhaps a separation of lower and higher classes?Maybe the unknown third-party makes us question who is the real head of a company? And Maybe the weird ending is supposed to signify that nothing matters anyways because big corporations don't care about your lives?Lots of maybe's and so many more questions as I read this book. Definitely a book that makes you put together pieces of a puzzle and think as you read it. I will definitely be reading this book again in the future to make more sense of it. I can already tell it will be just as good a second time. Overall Score: 3.9/5",
      "title": "The Employees"
    }
  ]
}